// List of questions
const questions = [
    "विद्युत क्षेत्र की तीव्रता किसे कहते हैं?",
"विद्युत् फ्लक्स किसे कहते हैं?",
"आवेश का क्वांटिकरण क्या है?",
"परावैद्युतांक किसे कहते है?",
"विद्युत द्विध्रुव किसे कहते हैं?",
"कूलाम का नियम लिखिए। इसका सूत्र ज्ञात कीजिये|",
"विद्युत क्षेत्र रेखाएँ किन्हे कहते हैं? इनके गुण लिखिए।",
"विद्युत द्विध्रुव के कारण अक्षीय स्थिति में विद्युत क्षेत्र की तीव्रता का व्यंजक ज्ञात कीजिए।",
"गॉस प्रमेय लिखिए तथा सिद्ध कीजिए।",
"गॉस के नियम द्वारा कुलाम के नियम की व्युत्पत्ति कीजिए।",
"विद्युत विभव किसे कहते हैं?",
"विभवांतर किसे कहते हैं?",
"धरिता किसे कहते हैं?",
"संधारित्र किसे कहते हैं?",
"समविभव पृष्ठ किसे कहते हैं? इसके गुण लिखिए।",
"विभव प्रवणता किसे कहते हैं? विभवानतर और विद्युत क्षेत्र की तीव्रता में संबंध लिखिए।",
"सिद्ध कीजिए कि निरक्षीय स्थिति में किसी बिंदु पर विभव शून्य होता है।",
"समांतर प्लेट संधारित्र की धारिता के लिए वयंजक ज्ञात कीजिए।",
"संधारित्र के श्रेणीक्रम और समांतर क्रम संयोजन के लिए सूत्र ज्ञात कीजिए।",
"आंशिक रूप से परावैद्युत पदार्थ की उपस्थिति में समांतर प्लेट संधारित्र की धरिता के लिए व्यंजक ज्ञात कीजिए।",
"संधारित्र में संचित स्थितिज ऊर्जा के लिए व्यंजक ज्ञात कीजिए।",
"परावैद्युत किसे कहते हैं? यह कितने प्रकार के होते हैं?",
"विद्युतधारा किसे कहते हैं? मात्रक, विमीय सुत्र, आदि।",
"धारा घनत्व क्या है?",
"ओम का नियम लिखिए एवं सत्यापित कीजिए।",
"अनुगमन वेग किसे कहते हैं? विद्युत धारा और अनुगमन वेग में संबंध स्थापित कीजिए।",
"ओम के नियम की सीमाएँ लिखिए।",
"विभिन्न पदार्थों की प्रतिरोधकता की ताप पर निर्भरता।",
"प्रतिरोध और प्रतिरोधकता में अंतर लिखिए।",
"गतिशीलता क्या हैं? इसके लिए व्यांजक ज्ञात कीजिए।",
"विद्युतशक्ति क्या है? इसके लिए व्यंजक ।",
"किसी सेल का आंतरिक प्रतिरोध किसे कहते हैं? ",
"विद्युत बाहक बल और विभवान्तर में अंतर लिखिए।",
"सेलों का श्रेणीक्रम और समांतर क्रम संयोजन ज्ञात कीजिए।",
"किरचॉफ के नियम लिखिए।",
"व्हीटस्टोन सेतु का सिद्धांत समझाइए।",
"विभवमापी, वोल्टमीटर से आधिक श्रेष्ठ है क्यों?",
];

// Function to generate random questions
function generateRandomQuestions() {
    const shuffledQuestions = questions.sort(() => 0.5 - Math.random());
    const selectedQuestions = shuffledQuestions.slice(0, 20);

    const questionContainer = document.getElementById('questionContainer');
    questionContainer.innerHTML = selectedQuestions.map(q => `<p>${q}</p>`).join('');
}

// Event listener for the button
document.getElementById('generateBtn').addEventListener('click', generateRandomQuestions);
